zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_selftest_v2.c
/***************************************************************************//**
* \file cy_capsense_selftest_v2.c
* \version 10.0.0
*
* \brief
* This file provides the source code to the Built-in Self-test (BIST)
* functions.
*
********************************************************************************
* \copyright
* (c) 2019-2026, Infineon Technologies AG, or an affiliate of Infineon
* Technologies AG. All rights reserved.
* This software, associated documentation and materials ("Software") is
* owned by Infineon Technologies AG or one of its affiliates ("Infineon")
* and is protected by and subject to worldwide patent protection, worldwide
* copyright laws, and international treaty provisions. Therefore, you may use
* this Software only as provided in the license agreement accompanying the
* software package from which you obtained this Software. If no license
* agreement applies, then any use, reproduction, modification, translation, or
* compilation of this Software is prohibited without the express written
* permission of Infineon.
*
* Disclaimer: UNLESS OTHERWISE EXPRESSLY AGREED WITH INFINEON, THIS SOFTWARE
* IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND, EXPRESS OR IMPLIED,
* INCLUDING, BUT NOT LIMITED TO, ALL WARRANTIES OF NON-INFRINGEMENT OF
* THIRD-PARTY RIGHTS AND IMPLIED WARRANTIES SUCH AS WARRANTIES OF FITNESS FOR A
* SPECIFIC USE/PURPOSE OR MERCHANTABILITY.
* Infineon reserves the right to make changes to the Software without notice.
* You are responsible for properly designing, programming, and testing the
* functionality and safety of your intended application of the Software, as
* well as complying with any legal requirements related to its use. Infineon
* does not guarantee that the Software will be free from intrusion, data theft
* or loss, or other breaches ("Security Breaches"), and Infineon shall have
* no liability arising out of any Security Breaches. Unless otherwise
* explicitly approved by Infineon, the Software may not be used in any
* application where a failure of the Product or any consequences of the use
* thereof can reasonably be expected to result in personal injury.
*******************************************************************************/


#include <stddef.h>
#include <string.h>
#include "cycfg_capsense_defines.h"
#include "cy_syslib.h"
#include "cy_capsense_common.h"
#include "cy_capsense_structure.h"
#include "cy_capsense_sensing.h"
#include "cy_capsense_sensing_v2.h"
#include "cy_capsense_lib.h"
#include "cy_capsense_selftest_v2.h"
#include "cy_gpio.h"

#if (defined(CY_IP_MXCSDV2) || defined(CY_IP_M0S8CSDV2))

#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_BIST_EN)

/*******************************************************************************
* Common local definitions for self-test
*******************************************************************************/

/* Port Data Register macros for BIST */
#define CY_CAPSENSE_BIST_DR_PIN2GND                             (0u)
#define CY_CAPSENSE_BIST_DR_PIN2VDD                             (1u)

#define CY_CAPSENSE_BIST_CP_MAX_VALUE                           (400000u)
#define CY_CAPSENSE_BIST_PROMILLE_FACTOR                        (1000u)
#define CY_CAPSENSE_BIST_SNS_CLK_MIN_DIVIDER                    (4u)
#define CY_CAPSENSE_BIST_SNS_CLK_MAX_DIVIDER                    (4096u)

/* Macros for the electrode capacitance measurement test */
#define CY_CAPSENSE_BIST_ELTD_CAP_MAX_RAW_PROMILLE              (450u)
#define CY_CAPSENSE_BIST_ELTD_CAP_MIN_RAW_PROMILLE              (75u)
#define CY_CAPSENSE_BIST_ELTD_CAP_MAX_RESOLUTION                (15u)
#define CY_CAPSENSE_BIST_ELTD_CAP_MIN_RESOLUTION                (8u)
#define CY_CAPSENSE_BIST_ELTD_CAP_CYCLES_NUM                    (4u)
#define CY_CAPSENSE_BIST_ELTD_CAP_MAX_MODCLK                    (50000000u)
#define CY_CAPSENSE_BIST_SW_DSI_SEL_DEFAULT                     (0x00000000uL)

/* IDAC register mask */
#define CY_CAPSENSE_BIST_IDAC_BITS_TO_WRITE                     (CSD_IDACA_VAL_Msk |\
                                                                 CSD_IDACA_RANGE_Msk |\
                                                                 CSD_IDACA_LEG1_EN_Msk |\
                                                                 CSD_IDACA_LEG2_EN_Msk |\
                                                                 CSD_IDACA_LEG1_MODE_Msk |\
                                                                 CSD_IDACA_LEG2_MODE_Msk)

#define CY_CAPSENSE_BIST_FSM_AZ0_SKIP                           (0x100u)
#define CY_CAPSENSE_BIST_FSM_AZ1_SKIP                           (0x200u)

/*******************************************************************************
* Macros for the external capacitor capacitance measurement test
*******************************************************************************/

#define CY_CAPSENSE_BIST_CAP_MEAS_DUTY_WIDTH                    (10u)
#define CY_CAPSENSE_BIST_CAP_MEAS_MAX_MODCLK                    (12500000u)
#define CY_CAPSENSE_BIST_CAP_MEAS_ACCURACY_FACTOR               (1150u)
#define CY_CAPSENSE_BIST_CAP_MEAS_MIN_RAWCOUNT                  (10u)
#define CY_CAPSENSE_BIST_CAP_MEAS_MAX_CAP                       (25u)
#define CY_CAPSENSE_BIST_CAP_MEAS_CMOD_MAX_VALUE                (5u)
#define CY_CAPSENSE_BIST_CAP_MEAS_CINT_MAX_VALUE                (1u)
#define CY_CAPSENSE_BIST_CAP_MEAS_CSH_MAX_VALUE                 (20u)
#define CY_CAPSENSE_BIST_CAP_MEAS_VREF_MV_DEFAULT               (1200u)
#define CY_CAPSENSE_BIST_CAP_MEAS_WDT_CYCLES_PER_LOOP           (5u)
#define CY_CAPSENSE_BIST_CAP_MEAS_WDT_TIMEOUT                   (3000u)

#define CY_CAPSENSE_BIST_PRECHARGE_MAX_TIME_US                  (6000u)
#define CY_CAPSENSE_BIST_WATCHDOG_MARGIN_COEFF                  (3u)
#define CY_CAPSENSE_BIST_PRECHARGE_WATCHDOG_TIME_US             (CY_CAPSENSE_BIST_PRECHARGE_MAX_TIME_US *\
                                                                 CY_CAPSENSE_BIST_WATCHDOG_MARGIN_COEFF)

/* HW block register values */
#define CY_CAPSENSE_BIST_CAP_SEQ_START_DEFAULT                  (CY_CAPSENSE_CSD_SEQ_START_AZ0_SKIP_MSK | \
                                                                 CY_CAPSENSE_CSD_SEQ_START_AZ1_SKIP_MSK | \
                                                                 CY_CAPSENSE_CSD_SEQ_START_START_MSK)
#define CY_CAPSENSE_BIST_CAP_CSDCMP_DEFAULT                     (CY_CAPSENSE_CSD_CSDCMP_CMP_PHASE_PHI2_MSK | \
                                                                 CY_CAPSENSE_CSD_CSDCMP_CSDCMP_EN_MSK)
#define CY_CAPSENSE_BIST_CAP_SENSE_DUTY_DEFAULT                 (CSD_SENSE_DUTY_OVERLAP_PHI1_Msk | \
                                                                 CSD_SENSE_DUTY_OVERLAP_PHI2_Msk | \
                                                                 CY_CAPSENSE_BIST_CAP_MEAS_DUTY_WIDTH)
#define CY_CAPSENSE_BIST_CAP_SW_BYP_SEL_DEFAULT                 (CY_CAPSENSE_CSD_SW_BYP_SEL_SW_BYA_MSK)
#define CY_CAPSENSE_BIST_CAP_SW_CMP_N_SEL_DEFAULT               (CY_CAPSENSE_CSD_SW_CMP_N_SEL_SW_SCRH_STATIC_CLOSE)
#define CY_CAPSENSE_BIST_CAP_SW_CMP_P_SEL_DEFAULT               (CY_CAPSENSE_CSD_SW_CMP_P_SEL_SW_SFMA_STATIC_CLOSE)
#define CY_CAPSENSE_BIST_CAP_SW_REFGEN_SEL_SRSS_DEFAULT         (CY_CAPSENSE_CSD_SW_REFGEN_SEL_SW_SGR_MSK)
#if (CY_CAPSENSE_PSOC6_FOURTH_GEN)
    #define CY_CAPSENSE_BIST_CAP_SW_REFGEN_SEL_PASS_DEFAULT     (CY_CAPSENSE_CSD_SW_REFGEN_SEL_SW_SGRP_MSK)
    #define CY_CAPSENSE_BIST_CAP_IO_SEL_DEFAULT                 (CY_CAPSENSE_CSD_TX_N_OUT_EN_PHI1 | \
                                                                 CY_CAPSENSE_CSD_TX_N_AMUXA_EN_PHI2)
#endif
#define CY_CAPSENSE_BIST_CAP_REFGEN_DEFAULT                     (CSD_REFGEN_REFGEN_EN_Msk | CSD_REFGEN_RES_EN_Msk)
#define CY_CAPSENSE_BIST_CAP_REFGEN_LOW_VOLTAGE_DEFAULT         (CSD_REFGEN_REFGEN_EN_Msk | CSD_REFGEN_BYPASS_Msk)
#define CY_CAPSENSE_BIST_CAP_CONFIG_DEFAULT                     (CY_CAPSENSE_CSD_CONFIG_FILTER_DELAY_48MHZ | \
                                                                 CSD_CONFIG_SENSE_EN_Msk | \
                                                                 CSD_CONFIG_ENABLE_Msk)
#if (CY_CAPSENSE_PSOC6_FOURTH_GEN)
    #define CY_CAPSENSE_BIST_CAP_CONFIG_IREF_DEFAULT            (CY_CAPSENSE_BIST_CAP_CONFIG_DEFAULT | \
                                                                 CY_CAPSENSE_CSD_CONFIG_IREF_SEL_MSK)
#endif
#define CY_CAPSENSE_BIST_CAP_IDAC_MODE_DEFAULT                  (CSD_IDACA_LEG1_MODE_Msk |\
                                                                 CSD_IDACA_LEG2_MODE_Msk)


