zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_selftest_v2.c
/*******************************************************************************
* Macros for the VDDA measurement test
*******************************************************************************/

/* SenseClkDivider value for VDDA measurement mode */
#define CY_CAPSENSE_BIST_VDDA_SENSE_DIV_DEFAULT                 (0x4u)
/* Minimal acceptable difference between the VDDA and VREF.
   It is not allowed to have (VDDA - VREF) > CY_CAPSENSE_BIST_VDDA_MIN_DIFF. */
#define CY_CAPSENSE_BIST_VDDA_MIN_DIFF                          (600u)
/* VREF voltage value, used for the VDDA measurement */
#define CY_CAPSENSE_BIST_VDDA_VREF_MIN_MV                       (1200u)
/* VDDA measurement resolution */
#define CY_CAPSENSE_BIST_VDDA_RES                               (2047u)
/* The total capacitance value of reference capacitors */
#define CY_CAPSENSE_BIST_VDDA_CREF                              (21500u)
/* The IDAC gain value, used for the VDDA measurement */
#define CY_CAPSENSE_BIST_VDDA_IDAC_LSB                          (37500u)
/* The MAX possible IDAC code value. */
#define CY_CAPSENSE_BIST_IDAC_MAX                               (127u)
/* The number of initial conversions per sample, used for the VDDA measurement */
#define CY_CAPSENSE_BIST_VDDA_INIT_CYCLES_NUM                   (1u)
/* The number of normal conversions per sample, used for the VDDA measurement */
#define CY_CAPSENSE_BIST_VDDA_NORM_CYCLES_NUM                   (2u)
/* The duration of the auto-zero stage in microseconds */
#define CY_CAPSENSE_BIST_VDDA_AZ_TIME_US                        (5u)
/* Acquisition time in microseconds */
#define CY_CAPSENSE_BIST_VDDA_ACQ_TIME_US                       (10u)
/* Acquisition time in microseconds */
#define CY_CAPSENSE_BIST_VDDA_MAX_MODCLK                        (50000000u)
/* Configures the count time A to bring Cref1 + Cref2 up from Vssa to Vrefhi with IDACB */
#define CY_CAPSENSE_BIST_VDDA_MEASMODE_VREF                     (0x1uL << CSD_ADC_CTL_ADC_MODE_Pos)
/*
 * Configures count time B to bring Cref1 + Cref2 back up to Vrefhi with IDACB
 * (after bringing them down for time A/2 cycles with IDACB sinking)
 */
#define CY_CAPSENSE_BIST_VDDA_MEASMODE_VREFBY2                  (0x2uL << CSD_ADC_CTL_ADC_MODE_Pos)
/* Configures the HSCMP polarity and count time C to source/sink Cref1 + Cref2 from Vin to Vrefhi */
#define CY_CAPSENSE_BIST_VDDA_MEASMODE_VIN                      (0x3uL << CSD_ADC_CTL_ADC_MODE_Pos)

/* Default HW block operation settings that are required for VDDA measurement */
#define CY_CAPSENSE_BIST_VDDA_CONFIG_DEFAULT                    (CY_CAPSENSE_CSD_CONFIG_ENABLE_MSK |\
                                                                 CY_CAPSENSE_CSD_CONFIG_SAMPLE_SYNC_MSK |\
                                                                 CY_CAPSENSE_CSD_CONFIG_SENSE_EN_MSK |\
                                                                 CY_CAPSENSE_CSD_CONFIG_DSI_COUNT_SEL_MSK)
#define CY_CAPSENSE_BIST_VDDA_AMBUF_DEFAULT                     (0u)
#define CY_CAPSENSE_BIST_VDDA_CSDCMP_DEFAULT                    (0u)
#define CY_CAPSENSE_BIST_VDDA_HSCMP_DEFAULT                     (CY_CAPSENSE_CSD_HSCMP_HSCMP_EN_MSK |\
                                                                 CY_CAPSENSE_CSD_HSCMP_AZ_EN_MSK)
#define CY_CAPSENSE_BIST_VDDA_IDACA_DEFAULT                     (0u)
#define CY_CAPSENSE_BIST_VDDA_IDACB_DEFAULT                     ((CY_CAPSENSE_CSD_IDACB_POL_DYN_DYNAMIC << \
                                                                  CY_CAPSENSE_CSD_IDACB_POL_DYN_POS) |\
                                                                  CY_CAPSENSE_CSD_IDACB_LEG3_EN_MSK)
#define CY_CAPSENSE_BIST_VDDA_SW_RES_DEFAULT                    (0u)
#define CY_CAPSENSE_BIST_VDDA_SENSE_PERIOD_DEFAULT              (CY_CAPSENSE_BIST_VDDA_SENSE_DIV_DEFAULT)
#define CY_CAPSENSE_BIST_VDDA_SENSE_DUTY_DEFAULT                (0u)
#define CY_CAPSENSE_BIST_VDDA_SEQ_INIT_CNT_DEFAULT              (CY_CAPSENSE_BIST_VDDA_INIT_CYCLES_NUM)
#define CY_CAPSENSE_BIST_VDDA_SEQ_NORM_CNT_DEFAULT              (CY_CAPSENSE_BIST_VDDA_NORM_CYCLES_NUM)
#define CY_CAPSENSE_BIST_VDDA_IO_SEL_DEFAULT                    (0u)
#define CY_CAPSENSE_BIST_VDDA_SEQ_START_MEASURE                 (CY_CAPSENSE_CSD_SEQ_START_AZ0_SKIP_MSK |\
                                                                 CY_CAPSENSE_CSD_SEQ_START_START_MSK)
#define CY_CAPSENSE_BIST_VDDA_SW_HS_P_SEL_DEFAULT               (CY_CAPSENSE_CSD_SW_HS_P_SEL_SW_HMRH_STATIC_CLOSE)
#define CY_CAPSENSE_BIST_VDDA_SW_HS_N_SEL_DEFAULT               (CY_CAPSENSE_CSD_SW_HS_N_SEL_SW_HCCD_STATIC_CLOSE)
#define CY_CAPSENSE_BIST_VDDA_SW_SHIELD_SEL_DEFAULT             (0u)
#define CY_CAPSENSE_BIST_VDDA_SW_AMUXBUF_SEL_DEFAULT            (0u)
#define CY_CAPSENSE_BIST_VDDA_SW_BYP_SEL_DEFAULT                (0u)
#define CY_CAPSENSE_BIST_VDDA_SW_CMP_P_SEL_DEFAULT              (0u)
#define CY_CAPSENSE_BIST_VDDA_SW_CMP_N_SEL_DEFAULT              (0u)
#define CY_CAPSENSE_BIST_VDDA_SW_DSI_SEL_DEFAULT                (0u)
#define CY_CAPSENSE_BIST_VDDA_SW_FW_MOD_SEL_DEFAULT             (CY_CAPSENSE_CSD_SW_FW_MOD_SEL_SW_C1CC_STATIC_CLOSE |\
                                                                 CY_CAPSENSE_CSD_SW_FW_MOD_SEL_SW_C1CD_STATIC_CLOSE)
#define CY_CAPSENSE_BIST_VDDA_SW_FW_TANK_SEL_DEFAULT            (CY_CAPSENSE_CSD_SW_FW_TANK_SEL_SW_C2CC_STATIC_CLOSE |\
                                                                 CY_CAPSENSE_CSD_SW_FW_TANK_SEL_SW_C2CD_STATIC_CLOSE)
#define CY_CAPSENSE_BIST_VDDA_WDT_CYCLES_PER_LOOP               (5u)
#define CY_CAPSENSE_BIST_VDDA_MAX_16_BITS                       (65535u)
/* In milliseconds */
#define CY_CAPSENSE_BIST_VDDA_WDT_TIMEOUT                       (10000u)

/*******************************************************************************
* Function Prototypes
*******************************************************************************/

/******************************************************************************/
/** \cond SECTION_CAPSENSE_INTERNAL */
/** \addtogroup group_capsense_internal *//** \{ */
/******************************************************************************/

