zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_selftest_v2.c
                    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN)
                        Cy_CapSense_BistSwitchAllShieldPinState(desiredIoState, context);
                    #endif

                    /* Set the divider value for the mod clock 1u lower than the desired divider */
                    Cy_CapSense_SetClkDivider(((uint32_t)context->ptrBistContext->eltdCapModClk - 1u), context);

                    /* Set the divider value for the sense clock (1u lower than the desired divider) */
                    context->ptrCommonConfig->ptrCsdBase->SENSE_PERIOD = ((uint32_t)context->ptrBistContext->eltdCapSnsClk - 1u);

                    /* Calculate the number of sub-conversions */
                    convNumber = (uint32_t)((0x01uL << context->ptrBistContext->eltdCapResolution) / context->ptrBistContext->eltdCapSnsClk);
                    if (convNumber == 0u)
                    {
                        convNumber = 1u;
                    }
                    context->ptrCommonConfig->ptrCsdBase->SEQ_NORM_CNT = convNumber;

                    Cy_CapSense_BistConnectElectrode(widgetId, sensorId, context);
                    result = Cy_CapSense_BistMeasureCapacitanceSensor(&context->ptrWdConfig[widgetId].ptrEltdCapacitance[sensorId], context);

                    Cy_CapSense_BistDisconnectElectrode(widgetId, sensorId, context);
                    if (NULL != ptrValue)
                    {
                        *ptrValue = context->ptrWdConfig[widgetId].ptrEltdCapacitance[sensorId];
                    }

                    /* Clear the BUSY flag */
                    context->ptrCommonContext->status = CY_CAPSENSE_NOT_BUSY;
                }
                else
                {
                    result = CY_CAPSENSE_BIST_HW_BUSY_E;
                }
            }
        }
    }

    return result;
}
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SNS_CAP_EN) */


#if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SH_CAP_EN) &&\
     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN))
/*******************************************************************************
* Function Name: Cy_CapSense_MeasureCapacitanceShield
****************************************************************************//**
*
* Measures shield electrode capacitance in femtofarads.
*
* This function measures the capacitance of the shield electrode and
* returns a status of this measurement. The measurement result in femtofarads
* is stored in the .shieldCap field of the \ref cy_stc_capsense_bist_context_t
* structure. If the shield consists of several electrodes, the total
* capacitance of all shield electrodes is reported.
*
* This function uses an algorithm identical to the sensor capacitance
* measurement. Refer to the Cy_CapSense_MeasureCapacitanceSensor() function
* for more details.
*
* In addition to measuring shield capacitance, this function is used to
* identify various fault conditions with a shield electrode such as an
* electrically-open or -short shield electrode, e.g. the PCB track is broken or
* shorted to other nodes in the system - in all of these conditions,
* this function returns changed capacitance that can be compared
* against pre-determined capacitance for the shield electrode to
* detect a fault condition.
*
* By default, all CAPSENSE&trade; sensors (electrodes) inherit regular
* scanning configuration. For example if the Inactive sensor
* connection parameter of the CSD sensing method is set to GND,
* sensors that are not being measured are set to the GND state.
* The inactive state can be changed in run-time by using
* the Cy_CapSense_SetInactiveElectrodeState() function.
* When the inactive sensor (electrode) connection is set
* to the CY_CAPSENSE_SNS_CONNECTION_SHIELD state,
* all the CAPSENSE&trade; electrodes are connected to the shield and
* the total capacitance are measured.
*
* By default, the Cmod capacitor is used for the measurement. If a dedicated
* Cmod is not available (e.g. the design has CSX widgets only), CintA and CintB
* capacitors are combined together by the firmware to form a single integration
* capacitor which is used for measurement.
*
* This test can be executed using the CapSense_RunSelfTest()
* function with the CY_CAPSENSE_BIST_SHIELD_CAP_MASK mask.
*
* \note
* This function is available only for the fourth-generation CAPSENSE&trade;.
*
* \param ptrValue
* The pointer to the variable the measured capacitance is stored. The user
* should declare a variable of uint32_t type and pass the variable pointer as
* the function parameter. If the ptrValue parameter is NULL then the shield
* capacitance value is not returned through the parameter but is still stored
* in the .shieldCap field of the \ref cy_stc_capsense_bist_context_t structure.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns a status of the test execution:
* - CY_CAPSENSE_BIST_SUCCESS_E          - The measurement completes
*                                         successfully, the result is valid.
* - CY_CAPSENSE_BIST_BAD_PARAM_E        - The input parameter is invalid.
*                                         The measurement was not executed.
* - CY_CAPSENSE_BIST_HW_BUSY_E          - The CSD HW block is busy with a
*                                         previous operation. The measurement
*                                         was not executed.
* - CY_CAPSENSE_BIST_LOW_LIMIT_E        - The measurement was executed but
*                                         the measured raw count is below
*                                         the minimum possible value.
*                                         The measurement result could be invalid.
*                                         The shield might be shorted to VDD
*                                         or a shield PCB track
*                                         is broken (the open shield electrode).
* - CY_CAPSENSE_BIST_HIGH_LIMIT_E       - The measurement was executed but the
*                                         measured raw count is above the
*                                         maximum possible value.
*                                         The measurement result is invalid.
*                                         The sensor might be shorted to GND.
* - CY_CAPSENSE_BIST_ERROR_E            - An unexpected fault occurred during
*                                         the measurement.
*
*******************************************************************************/
cy_en_capsense_bist_status_t Cy_CapSense_MeasureCapacitanceShield(
                uint32_t * ptrValue,
                cy_stc_capsense_context_t * context)
{
    cy_en_capsense_bist_status_t result = CY_CAPSENSE_BIST_BAD_PARAM_E;
    uint32_t convNumber;

    if (NULL != context)
    {
        if ((0u != context->ptrCommonConfig->csdShieldNumPin) ||
           (CY_CAPSENSE_BIST_IO_SHIELD_E == context->ptrBistContext->intrEltdCapShieldISC))
        {
            /* Release previously-captured HW resources by the other mode and capture them for BIST */
            if (CY_CAPSENSE_SUCCESS_E == Cy_CapSense_SwitchSensingMode(CY_CAPSENSE_BIST_GROUP, context))
            {
                /* Set the BUSY status */
                context->ptrCommonContext->status = CY_CAPSENSE_BUSY;

                /* Set all sensor pins to an ISC */
                if (CY_CAPSENSE_BIST_IO_SHIELD_E == context->ptrBistContext->intrEltdCapShieldISC)
                {
                    Cy_CapSense_BistSwitchAllSnsPinState(CY_CAPSENSE_BIST_IO_SENSE_E, context);
                }
                else
                {
                    Cy_CapSense_BistSwitchAllSnsPinState(context->ptrBistContext->intrEltdCapShieldISC, context);
                }

                /* Connect shield electrode(s) to Analog bus A to measure the capacitance */
                Cy_CapSense_SetShieldPinState(CY_CAPSENSE_CSD_SCAN_PIN_DM, 0u, CY_CAPSENSE_HSIOM_SEL_CSD_SENSE, context);
                /* Switch theHW resource configuration to the sensor short test */
                Cy_CapSense_BistSwitchHwConfig(CY_CAPSENSE_BIST_HW_ELTD_CAP_E, context);
                /* Set the divider value for mod clock (1u lower than the desired divider) */
                Cy_CapSense_SetClkDivider(((uint32_t)context->ptrBistContext->eltdCapModClk - 1u), context);
                /* Set the divider value for the sense clock (1u lower than the desired divider) */
                context->ptrCommonConfig->ptrCsdBase->SENSE_PERIOD = ((uint32_t)context->ptrBistContext->eltdCapSnsClk - 1u);
                /* Calculate the conversion number to rich the desired resolution */
                convNumber = (uint32_t)((0x01uL << context->ptrBistContext->eltdCapResolution) / context->ptrBistContext->eltdCapSnsClk);
                if (convNumber == 0u)
                {
                    convNumber = 1u;
                }

                /* Set Number Of Conversions based on scanning resolution */
                context->ptrCommonConfig->ptrCsdBase->SEQ_NORM_CNT = convNumber;
                /* Measure and store the shield electrode(s) capacitance value, return the value and status */
                result = Cy_CapSense_BistMeasureCapacitanceSensor(&context->ptrBistContext->shieldCap, context);
                if (NULL != ptrValue)
                {
                    *ptrValue = context->ptrBistContext->shieldCap;
                }

                /* Clear the BUSY flag */
                context->ptrCommonContext->status = CY_CAPSENSE_NOT_BUSY;
            }
            else
            {
                result = CY_CAPSENSE_BIST_HW_BUSY_E;
            }
        }
    }

    return result;
}
#endif /* ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SH_CAP_EN) && (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN)) */


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SNS_CAP_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_MeasureCapacitanceSensorExt
****************************************************************************//**
*
* Measures specified widget/sensor (electrode) capacitance using specified
* scanning parameters.
*
* This function performs a single scan using the CSD sensing method and then
* converts the measured raw count into capacitance using the following equation:
*
* Cs = Rawcount * I / ((2^Res - 1) * Vref * SnsClk)
*
* Where:
* * Cs is the sensor capacitance.
* * Rawcount is the measured raw count value.
* * I is the current equal to IDAC gain * IDAC code
*   (Compensation IDAC is disabled).
* * Res is the scanning resolution.
* * Vref is the reference voltage.
* * SnsClk is the sensor clock frequency.
*
* By default,the  Cmod capacitor is used for the measurement. If a dedicated
* Cmod is not available (e.g. the design has CSX widgets only), the CintA and
* CintB capacitors are combined together by the firmware to form a single
* integration capacitor for the measurement.
*
* This function must not be called while the CSD HW block is busy by another
* state.
*
* It is not recommended to use this function in application code. The function
* usage requires expert knowledge of the CAPSENSE&trade; HW block, details of operation,
* details of scanning parameters, and their interdependencies. The function
* does not perform parameter values validation, and it is easy to break
* CAPSENSE&trade; operation using this function.
*
* \param widgetId
* Specifies the ID number of the widget.
* A macro for the widget ID can be found in the
* CAPSENSE&trade; Configuration header file (cycfg_capsense.h) defined as
* CY_CAPSENSE_<WidgetName>_WDGT_ID.
*
* \param sensorId
* Specifies the ID of the sensor (electrode for CSX widgets) within the widget
* to be measured.
*
* For the CSD widgets, a macro for the sensor ID within the specified widget
* can be found in the CAPSENSE&trade; Configuration header file (cycfg_capsense.h)
* defined as CY_CAPSENSE_<WidgetName>_SNS<SensorNumber>_ID.
*
* For the CSX widgets, sensorId is an electrode ID and is defined as Rx ID
* or Tx ID. The first Rx in a widget corresponds to electrodeId = 0, the
* second Rx in a widget corresponds to electrodeId = 1, and so on.
* The last Tx in a widget corresponds to electrodeId = (RxNum + TxNum - 1).
* Macros for Rx and Tx IDs can be found in the CAPSENSE&trade; Configuration header
* file (cycfg_capsense.h) defined as:
* * CapSense_<WidgetName>_RX<RXNumber>_ID
* * CapSense_<WidgetName>_TX<TXNumber>_ID.
*
* \param ptrScanConfig
* The pointer to the scan configuration parameter structure. The user
* should initialize all the scan configuration parameters before
* the function usage.
*
* \param ptrValue
* The pointer to the result of scan. The result is calculated as a sensor
* capacitance value in femtofarads. The user
* declares a variable of uint32_t type and passes the variable pointer as
* the function parameter.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns a status of the test execution:
* - CY_CAPSENSE_BIST_SUCCESS_E          - The scan completes successfully,
*                                         the calculated capacitance value is valid.
* - CY_CAPSENSE_BIST_BAD_PARAM_E        - The input parameter is invalid.
*                                         The measurement was not executed.
* - CY_CAPSENSE_BIST_HW_BUSY_E          - The CSD HW block is busy with a
*                                         previous operation. The measurement
*                                         was not executed.
* - CY_CAPSENSE_BIST_TIMEOUT_E          - The software watchdog timeout occurred
*                                         during the scan, the scan was not
*                                         completed, the calculated
*                                         capacitance is invalid.
*
*******************************************************************************/
cy_en_capsense_bist_status_t Cy_CapSense_MeasureCapacitanceSensorExt(
                uint32_t widgetId,
                uint32_t sensorId,
                cy_stc_capsense_bist_custom_parameters_t * ptrScanConfig,
                uint32_t * ptrValue,
                cy_stc_capsense_context_t * context)
{
    cy_en_capsense_bist_status_t result = CY_CAPSENSE_BIST_BAD_PARAM_E;
    cy_en_capsense_bist_io_state_t desiredIoState;
    cy_en_capsense_bist_hw_config_t hwConfiguration;
    uint32_t numWdgtElectrodes;
    uint32_t rawCountTmp;
    uint32_t idacIdx;
    uint32_t idacCode;
    uint32_t snsClkFreqHz;
    uint32_t rawMaxNum;
    uint32_t vRefMv;
    uint32_t temp;
    uint64_t cp;
    uint32_t modClkDivider;
    uint32_t snsClkDivider;
    uint32_t cpuFreqMHz;
    uint32_t watchdogPeriod;
    uint64_t isBusyWatchdogTimeUs;


    if ((NULL != context) && (NULL != ptrScanConfig))
    {
        idacIdx = (uint32_t)ptrScanConfig->idacGainIndex;
        idacCode = (uint32_t)ptrScanConfig->idacMod;
        if (0u == ptrScanConfig->modClk)
        {
            ptrScanConfig->modClk = 1u;
        }
        snsClkFreqHz = context->ptrCommonConfig->periClkHz / ptrScanConfig->modClk / ptrScanConfig->snsClk;
        rawMaxNum = ((uint32_t)ptrScanConfig->convNum * (uint32_t)ptrScanConfig->snsClk) - 1u;

        if ((context->ptrCommonConfig->numWd > widgetId))
        {
            /* Get a total number of widget elements: for CSX, it is numRows + numCols, for CSD, it is totalNumSns */
            if (CY_CAPSENSE_CSX_GROUP == context->ptrWdConfig[widgetId].senseMethod)
            {
                /* For CSX widgets, get the index of the Rx electrode */
                numWdgtElectrodes = context->ptrWdConfig[widgetId].numRows +
                          (uint32_t)context->ptrWdConfig[widgetId].numCols;
                desiredIoState = context->ptrBistContext->intrEltdCapCsxISC;
            }
            else
            {
                numWdgtElectrodes = context->ptrWdConfig[widgetId].numSns;
                desiredIoState = context->ptrBistContext->intrEltdCapCsdISC;
            }
            if (numWdgtElectrodes > sensorId)
            {
                /* Release previously-captured HW resources by the other mode and capture them for BIST */
                if (CY_CAPSENSE_SUCCESS_E == Cy_CapSense_SwitchSensingMode(CY_CAPSENSE_BIST_GROUP, context))
                {
                    /* Set the BUSY status */
                    context->ptrCommonContext->status = CY_CAPSENSE_BUSY;
                    hwConfiguration = CY_CAPSENSE_BIST_HW_ELTD_CAP_E;
                    if (CY_CAPSENSE_BIST_IO_SHIELD_E == desiredIoState)
                    {
                        hwConfiguration = CY_CAPSENSE_BIST_HW_ELTD_CAP_SH_E;
                    }
                    /* Switch the HW resource configuration to sensor short test */
                    Cy_CapSense_BistSwitchHwConfig(hwConfiguration, context);
                    Cy_CapSense_BistSwitchAllSnsPinState(desiredIoState, context);
                    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN)
                        Cy_CapSense_BistSwitchAllShieldPinState(desiredIoState, context);
                    #endif
                    /* Calculate the VrefHigh voltage */
                    vRefMv = Cy_CapSense_GetVrefHighMv((uint32_t)ptrScanConfig->vrefGain, context);

                    /* RefGen initialization */
                    temp = CSD_REFGEN_REFGEN_EN_Msk | CSD_REFGEN_RES_EN_Msk |
                            ((uint32_t)ptrScanConfig->vrefGain << CSD_REFGEN_GAIN_Pos);
                    #if (CY_CAPSENSE_PSOC4_FOURTH_GEN)
                        if (CY_CAPSENSE_LOW_VOLTAGE_LIMIT > context->ptrCommonConfig->vdda)
                        {
                            temp = CSD_REFGEN_REFGEN_EN_Msk | CSD_REFGEN_BYPASS_Msk;
                        }
                    #endif
                    context->ptrCommonConfig->ptrCsdBase->REFGEN = temp;

