zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_selftest_v2.c
                    /* Connect the specified sensor (CSX electrode) */
                    Cy_CapSense_BistConnectElectrode(widgetId, sensorId, context);
                    /* Set the divider value for the mod clock (1u lower than the desired divider) */
                    Cy_CapSense_SetClkDivider(((uint32_t)ptrScanConfig->modClk - 1u), context);
                    /* Set the divider value for the sense clock (1u lower than the desired divider) */
                    context->ptrCommonConfig->ptrCsdBase->SENSE_PERIOD = ((uint32_t)ptrScanConfig->snsClk - 1u);
                    /* Set Number Of Conversions for the custom scan */
                    context->ptrCommonConfig->ptrCsdBase->SEQ_NORM_CNT = (uint32_t)ptrScanConfig->convNum;
                    /* Setup the IDAC code and Gain */
                    context->ptrCommonConfig->ptrCsdBase->IDACA =
                            (context->ptrCommonConfig->ptrCsdBase->IDACA & ~CY_CAPSENSE_BIST_IDAC_BITS_TO_WRITE) |
                            ((context->ptrCommonConfig->idacGainTable[idacIdx].gainReg | idacCode |
                            CSD_IDACA_LEG1_MODE_Msk | CSD_IDACA_LEG2_MODE_Msk) & CY_CAPSENSE_BIST_IDAC_BITS_TO_WRITE);

                    /* Perform scanning */
                    result = Cy_CapSense_BistMeasureCapacitanceSensorRun(context);
                    if (CY_CAPSENSE_BIST_TIMEOUT_E != result)
                    {
                        modClkDivider = ptrScanConfig->modClk;
                        snsClkDivider = ptrScanConfig->snsClk;

                        if (0u == snsClkDivider)
                        {
                            snsClkDivider = 1u;
                        }

                        isBusyWatchdogTimeUs  = (uint64_t)ptrScanConfig->convNum;
                        isBusyWatchdogTimeUs *= (uint64_t)snsClkDivider * modClkDivider * CY_CAPSENSE_CONVERSION_MEGA;
                        isBusyWatchdogTimeUs /= context->ptrCommonConfig->periClkHz;

                        if (0u == isBusyWatchdogTimeUs)
                        {
                            isBusyWatchdogTimeUs = 1u;
                        }

                        isBusyWatchdogTimeUs *= CY_CAPSENSE_BIST_WATCHDOG_MARGIN_COEFF;

                        cpuFreqMHz = context->ptrCommonConfig->cpuClkHz / CY_CAPSENSE_CONVERSION_MEGA;
                        watchdogPeriod = Cy_CapSense_WatchdogCyclesNum((uint32_t)isBusyWatchdogTimeUs, cpuFreqMHz,
                                                                       CY_CAPSENSE_BIST_CAP_MEAS_WDT_CYCLES_PER_LOOP);

                        /* Wait for the end of the scan and get the raw counts */
                        if (0u == Cy_CapSense_BistWaitEndOfScan(watchdogPeriod, context))
                        {
                            result = CY_CAPSENSE_BIST_TIMEOUT_E;
                        }
                        else
                        {
                            rawCountTmp = (context->ptrCommonConfig->ptrCsdBase->RESULT_VAL1 &
                                          CY_CAPSENSE_CSD_RESULT_VAL1_VALUE_MSK);
                            /* Capacitance calculation and storage */
                            if (NULL != ptrValue)
                            {
                                cp = ((uint64_t)context->ptrCommonConfig->idacGainTable[idacIdx].gainValue) * (uint64_t)idacCode;
                                cp *= (uint64_t)rawCountTmp;
                                cp *= CY_CAPSENSE_CONVERSION_MEGA;
                                cp /= (uint64_t)rawMaxNum;
                                cp /= (uint64_t)snsClkFreqHz;
                                cp /= (uint64_t)vRefMv;
                                if (((uint64_t)CY_CAPSENSE_BIST_CP_MAX_VALUE) < cp)
                                {
                                    cp = (uint64_t)CY_CAPSENSE_BIST_CP_MAX_VALUE;
                                }
                                *ptrValue = (uint32_t)cp;
                            }
                            result = CY_CAPSENSE_BIST_SUCCESS_E;
                        }
                    }
                    /* Clear all interrupt pending requests */
                    context->ptrCommonConfig->ptrCsdBase->INTR = CY_CAPSENSE_CSD_INTR_ALL_MSK;
                    (void)context->ptrCommonConfig->ptrCsdBase->INTR;
                    /* Disconnect the sensor */
                    Cy_CapSense_BistDisconnectElectrode(widgetId, sensorId, context);
                    /* Clear the BUSY flag */
                    context->ptrCommonContext->status = CY_CAPSENSE_NOT_BUSY;
                }
                else
                {
                    result = CY_CAPSENSE_BIST_HW_BUSY_E;
                }
            }
        }
    }

    return result;
}
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SNS_CAP_EN) */


#if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SH_CAP_EN) ||\
     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SNS_CAP_EN))
/*******************************************************************************
* Function Name: Cy_CapSense_BistMeasureCapacitanceSensorInit
****************************************************************************//**
*
* This internal function calculates the parameters for sensor or shield
* capacitance measurements and register values before speeding up
* the execution.
*
* It is called by Cy_CapSense_BistDsInitialize() once at the CAPSENSE&trade; MW start.
*
* The following parameters of cy_stc_capsense_bist_context_t are used as
* an input for the calculation:
* * .eltdCapModClk
* * .eltdCapSnsClk
* * .eltdCapVrefMv
* * .eltdCapResolution
*
* The function checks for parameter limitations and corrects the values before
* the calculation if they exceed.
*
* The following parameters of cy_stc_capsense_bist_context_t are updated
* by the calculation:
* * .eltdCapModClk
* * .eltdCapSnsClk
* * .eltdCapSnsClkFreqHz
* * .eltdCapVrefGain
* * .eltdCapVrefMv
* * .eltdCapResolution
*
* Restarting CAPSENSE&trade; MW or calling of the Cy_CapSense_BistDsInitialize()
* function overwrites the output parameters.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
static void Cy_CapSense_BistMeasureCapacitanceSensorInit(
                cy_stc_capsense_context_t * context)
{
    uint32_t temp;
    cy_stc_capsense_bist_context_t * ptrBistCxt = context->ptrBistContext;

    /* ModClk */
    if (0u == ptrBistCxt->eltdCapModClk)
    {
        ptrBistCxt->eltdCapModClk = 1u;
    }
    if (CY_CAPSENSE_BIST_ELTD_CAP_MAX_MODCLK < (context->ptrCommonConfig->periClkHz / ptrBistCxt->eltdCapModClk))
    {
        ptrBistCxt->eltdCapModClk <<= 1u;
    }

