zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_selftest_v2.c
        /* Connect the capacitor to the analog bus for further measurement */
        Cy_CapSense_SsConfigPinRegisters(ptrCapPort, capacitorPin, CY_CAPSENSE_CSD_SCAN_PIN_DM, CY_CAPSENSE_HSIOM_SEL_CSD_SENSE);
        /* Perform the measurement */
        bistStatus = Cy_CapSense_BistMeasureCapacitanceCapRun(&extCapValue, context);
        /* Disconnect and discharge the capacitor */
        Cy_CapSense_SsConfigPinRegisters(ptrCapPort, capacitorPin, CY_CAPSENSE_DM_GPIO_STRONG_IN_OFF, CY_CAPSENSE_HSIOM_SEL_GPIO);
        Cy_GPIO_Clr(ptrCapPort, capacitorPin);

        if (CY_CAPSENSE_BIST_TIMEOUT_E != bistStatus)
        {
            *ptrResult = (uint16_t)extCapValue;
            if (NULL != ptrValue)
            {
                *ptrValue = extCapValue;
            }
        }
        /* Clear the BUSY flag */
        context->ptrCommonContext->status = CY_CAPSENSE_NOT_BUSY;
    }
    return bistStatus;
}


/*******************************************************************************
* Function Name: Cy_CapSense_BistMeasureCapacitanceCapInit
****************************************************************************//**
*
* This internal function calculates the parameters for the external capacitor
* capacitance measurement and register values before speeding up
* the execution.
*
* It is called by Cy_CapSense_BistDsInitialize() once at CAPSENSE&trade; MW start.
*
* The following parameters of cy_stc_capsense_bist_context_t are used as
* an input for the calculation:
* * .extCapModClk
* * .extCapVrefMv
* * .extCapModClk
*
* The following parameters of cy_stc_capsense_bist_context_t are updated
* by the calculation:
* * .extCapModClk
* * .extCapVrefMv
* * .extCapVrefGain
* * .extCapWDT
*
* Restarting CAPSENSE&trade; MW or calling of the Cy_CapSense_BistDsInitialize()
* function overwrites the output parameters.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
static void Cy_CapSense_BistMeasureCapacitanceCapInit(
                cy_stc_capsense_context_t * context)
{
    uint32_t temp;
    cy_stc_capsense_bist_context_t * ptrBistCxt = context->ptrBistContext;

    if (0u == ptrBistCxt->extCapModClk)
    {
        ptrBistCxt->extCapModClk = 1u;
    }
    while (CY_CAPSENSE_BIST_CAP_MEAS_MAX_MODCLK < (context->ptrCommonConfig->periClkHz / ptrBistCxt->extCapModClk))
    {
        ptrBistCxt->extCapModClk <<= 1u;
    }

    if (ptrBistCxt->extCapVrefMv == 0u)
    {
        /* Get the recommended reference voltage */
        temp = CY_CAPSENSE_BIST_CAP_MEAS_VREF_MV_DEFAULT;
    }
    else
    {
        /* Use the user-defined reference voltage */
        temp = (uint32_t)ptrBistCxt->extCapVrefMv;
    }
    ptrBistCxt->extCapVrefGain = (uint8_t)Cy_CapSense_GetVrefHighGain(temp, context);
    ptrBistCxt->extCapVrefMv = (uint16_t)Cy_CapSense_GetVrefHighMv((uint32_t)ptrBistCxt->extCapVrefGain, context);

    ptrBistCxt->extCapWDT = CY_CAPSENSE_BIST_CAP_MEAS_WDT_TIMEOUT;
    ptrBistCxt->capacitorSettlingTime = CY_CAPSENSE_BIST_CAP_SETTLING_TIME_DEFAULT;
}


/*******************************************************************************
* Function Name: Cy_CapSense_BistMeasureCapacitanceCapEnable
****************************************************************************//**
*
* This internal function configures the CSD HW block operation and
* the HW block-level analog routing to the external capacitor capacitance
* measurement test.
*
* Sets up the CSD HW block to perform the external capacitor capacitance
* measuring.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
static void Cy_CapSense_BistMeasureCapacitanceCapEnable(
                cy_stc_capsense_context_t * context)
{
    CSD_Type * ptrCsdHwBase = context->ptrCommonConfig->ptrCsdBase;

    /* Disable all interrupts from the HW block */
    ptrCsdHwBase->INTR_MASK = CY_CAPSENSE_CSD_INTR_MASK_CLEAR_MSK;
    (void)ptrCsdHwBase->INTR_MASK;
    /* Clear all pending interrupt requests */
    ptrCsdHwBase->INTR = CY_CAPSENSE_CSD_INTR_ALL_MSK;
    (void)ptrCsdHwBase->INTR;

    /* Set the divider value for mod clock (1u lower than the desired divider) */
    Cy_CapSense_SetClkDivider(((uint32_t)context->ptrBistContext->extCapModClk - 1u), context);

    Cy_CapSense_BistSwitchAllSnsPinState(CY_CAPSENSE_BIST_IO_STRONG_E, context);
    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN)
        Cy_CapSense_BistSwitchAllShieldPinState(CY_CAPSENSE_BIST_IO_STRONG_E, context);
    #endif
    Cy_CapSense_BistSwitchAllExternalCapPinState(CY_CAPSENSE_BIST_IO_STRONG_E, context);
    /* Wait for the maximum possible external capacitor charging time */
    Cy_SysLib_DelayUs(context->ptrBistContext->capacitorSettlingTime);

    /* Initialize the CSD registers to perform external capacitor capacitance measurement */
    ptrCsdHwBase->CONFIG = CY_CAPSENSE_BIST_CAP_CONFIG_DEFAULT;
    ptrCsdHwBase->SW_REFGEN_SEL = CY_CAPSENSE_BIST_CAP_SW_REFGEN_SEL_SRSS_DEFAULT;
    #if (CY_CAPSENSE_PSOC6_FOURTH_GEN)
        if (CY_CAPSENSE_IREF_PASS == context->ptrCommonConfig->ssIrefSource)
        {
            ptrCsdHwBase->CONFIG = CY_CAPSENSE_BIST_CAP_CONFIG_IREF_DEFAULT;
        }
        if (CY_CAPSENSE_VREF_PASS == context->ptrCommonConfig->ssVrefSource)
        {
            ptrCsdHwBase->SW_REFGEN_SEL = CY_CAPSENSE_BIST_CAP_SW_REFGEN_SEL_PASS_DEFAULT;
        }
        ptrCsdHwBase->IO_SEL = CY_CAPSENSE_BIST_CAP_IO_SEL_DEFAULT;
    #endif
    ptrCsdHwBase->REFGEN = CY_CAPSENSE_BIST_CAP_REFGEN_DEFAULT |
                          ((uint32_t)context->ptrBistContext->extCapVrefGain << CSD_REFGEN_GAIN_Pos);
    #if (CY_CAPSENSE_PSOC4_FOURTH_GEN)
        if (CY_CAPSENSE_LOW_VOLTAGE_LIMIT > context->ptrCommonConfig->vdda)
        {
            ptrCsdHwBase->REFGEN = CY_CAPSENSE_BIST_CAP_REFGEN_LOW_VOLTAGE_DEFAULT;
        }
    #endif
    ptrCsdHwBase->CSDCMP = CY_CAPSENSE_BIST_CAP_CSDCMP_DEFAULT;
    ptrCsdHwBase->SENSE_DUTY = CY_CAPSENSE_BIST_CAP_SENSE_DUTY_DEFAULT;
    ptrCsdHwBase->SENSE_PERIOD = (uint32_t)context->ptrBistContext->extCapSnsClk - 1u;
    ptrCsdHwBase->SEQ_NORM_CNT = 1u;
    ptrCsdHwBase->SEQ_TIME = 0uL;
    ptrCsdHwBase->SEQ_INIT_CNT = 0uL;
    ptrCsdHwBase->ADC_CTL = 0uL;
    ptrCsdHwBase->IDACA = 0u;
    ptrCsdHwBase->IDACB = 0u;
    ptrCsdHwBase->INTR_SET = 0uL;
    ptrCsdHwBase->HSCMP = 0uL;
    ptrCsdHwBase->AMBUF = 0uL;
    ptrCsdHwBase->SW_RES = 0uL;
    ptrCsdHwBase->SW_HS_P_SEL = 0uL;
    ptrCsdHwBase->SW_HS_N_SEL = 0uL;
    ptrCsdHwBase->SW_SHIELD_SEL = 0u;
    ptrCsdHwBase->SW_AMUXBUF_SEL = 0uL;
    ptrCsdHwBase->SW_FW_MOD_SEL = 0uL;
    ptrCsdHwBase->SW_FW_TANK_SEL = 0uL;
    ptrCsdHwBase->SW_DSI_SEL = 0uL;
    ptrCsdHwBase->SW_BYP_SEL = CY_CAPSENSE_BIST_CAP_SW_BYP_SEL_DEFAULT;
    ptrCsdHwBase->SW_CMP_N_SEL = CY_CAPSENSE_BIST_CAP_SW_CMP_N_SEL_DEFAULT;
    ptrCsdHwBase->SW_CMP_P_SEL = CY_CAPSENSE_BIST_CAP_SW_CMP_P_SEL_DEFAULT;
}


