zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_selftest_v2.c
/*******************************************************************************
* Function Name: Cy_CapSense_BistMeasureCapacitanceCapRun
****************************************************************************//**
*
* This internal function starts the specific scan for the external capacitor
* capacitance measurement.
*
* \param ptrExtCapValue
* The pointer to the result of the measurement in picofarads.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns a status of the test execution:
* - CY_CAPSENSE_BIST_SUCCESS_E - The measurement completes
*                              successfully, the result is valid.
* - CY_CAPSENSE_BIST_LOW_LIMIT_E - A measured capacitance is below
*                                the minimum possible value.
*                                The measurement result is invalid.
*                                The capacitor might be shorted to VDD or a
*                                PCB track is broken (open capacitor).
* - CY_CAPSENSE_BIST_HIGH_LIMIT_E - The measured capacitance is above the
*                                 maximum possible value.
*                                 The measurement result is invalid.
*                                 The capacitor might be shorted to GND.
* - CY_CAPSENSE_BIST_TIMEOUT_E - The measuring scan is not finished properly
*                                and reached the timeout.
*
*******************************************************************************/
static cy_en_capsense_bist_status_t Cy_CapSense_BistMeasureCapacitanceCapRun(
                uint32_t * ptrExtCapValue,
                cy_stc_capsense_context_t * context)
{
    uint32_t tempRawcount;
    uint64_t tempCapacitance;
    cy_en_capsense_bist_status_t bistStatus = CY_CAPSENSE_BIST_TIMEOUT_E;
    CSD_Type * ptrCsdHwBase = context->ptrCommonConfig->ptrCsdBase;
    uint32_t watchdogPeriod;

    watchdogPeriod = Cy_CapSense_WatchdogCyclesNum(
            (uint32_t)context->ptrBistContext->extCapWDT,
            (context->ptrCommonConfig->cpuClkHz / CY_CAPSENSE_CONVERSION_MEGA),
            CY_CAPSENSE_BIST_CAP_MEAS_WDT_CYCLES_PER_LOOP);

    /* Clear all pending interrupt requests */
    ptrCsdHwBase->INTR = CY_CAPSENSE_CSD_INTR_ALL_MSK;
    (void)ptrCsdHwBase->INTR;

    /* Start SEQUENCER for fine initialization and then for conversion */
    ptrCsdHwBase->SEQ_START = CY_CAPSENSE_BIST_CAP_SEQ_START_DEFAULT;

    /* Wait for the end of the scan and get the raw counts */
    if (0u != Cy_CapSense_BistWaitEndOfScan(watchdogPeriod, context))
    {
        tempRawcount = ptrCsdHwBase->RESULT_VAL1 &
                       CY_CAPSENSE_CSD_RESULT_VAL1_VALUE_MSK;

        /* Check for the measurement result status */
        if (CY_CAPSENSE_BIST_CAP_MEAS_MIN_RAWCOUNT > tempRawcount)
        {
            bistStatus = CY_CAPSENSE_BIST_LOW_LIMIT_E;
        }
        else if (((uint32_t)context->ptrBistContext->extCapSnsClk - CY_CAPSENSE_BIST_CAP_MEAS_DUTY_WIDTH) < tempRawcount)
        {
            bistStatus = CY_CAPSENSE_BIST_HIGH_LIMIT_E;
        }
        else
        {
            bistStatus = CY_CAPSENSE_BIST_SUCCESS_E;
        }

        /* Calculate the capacitance value in pF */
        tempCapacitance = (((((uint64_t)context->ptrBistContext->extCapIdacPa *
                              (uint64_t)context->ptrBistContext->extCapModClk) * (uint64_t)tempRawcount) *
                              (uint64_t)CY_CAPSENSE_BIST_PROMILLE_FACTOR) /
                              (uint64_t)context->ptrCommonConfig->periClkHz) /
                              (uint64_t)context->ptrBistContext->extCapVrefMv;
        *ptrExtCapValue = (uint32_t)tempCapacitance;
    }

    return bistStatus;
}


/*******************************************************************************
* Function Name: Cy_CapSense_BistMeasureCapacitanceCapAll
****************************************************************************//**
*
* This internal function measures capacitance of all external capacitors.
*
* The function measures capacitances of all external capacitors Cmod,
* Csh, CintA, CintB (if available in a design).
* The function stores cap values in the corresponding registers.
* The function is called by the Cy_CapSense_RunSelfTest() function.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns a status of the test execution:
* - CY_CAPSENSE_BIST_SUCCESS_E - The measurement completes
*                              successfully, the result is valid.
* - CY_CAPSENSE_BIST_BAD_PARAM_E - The input parameter is invalid.
* - CY_CAPSENSE_BIST_HW_BUSY_E - The CSD HW block is busy with a previous
*                              operation.
* - CY_CAPSENSE_BIST_LOW_LIMIT_E - A measured capacitance is below
*                                the minimum possible value.
*                                The measurement result is invalid.
*                                The capacitor might be shorted to VDD or a
*                                PCB track is broken (open capacitor).
* - CY_CAPSENSE_BIST_HIGH_LIMIT_E - The measured capacitance is above the
*                                 maximum possible value.
*                                 The measurement result is invalid.
*                                 The capacitor might be shorted to GND.
* - CY_CAPSENSE_BIST_ERROR_E - An unexpected fault occurred during
*                            the measurement, you may need to repeat the measurement.
*
*******************************************************************************/
static cy_en_capsense_bist_status_t Cy_CapSense_BistMeasureCapacitanceCapAll(
                cy_stc_capsense_context_t * context)
{
    uint32_t capCapacitance = 0u;
    cy_en_capsense_bist_status_t tempStatus;
    cy_en_capsense_bist_status_t bistStatus = CY_CAPSENSE_BIST_SUCCESS_E;

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN)
        tempStatus = Cy_CapSense_MeasureCapacitanceCap_V2(CY_CAPSENSE_BIST_CMOD_ID_E, &capCapacitance,
                CY_CAPSENSE_BIST_CAP_MEAS_CMOD_MAX_VALUE, context);
        if (CY_CAPSENSE_BIST_SUCCESS_E != tempStatus)
        {
            bistStatus = tempStatus;
        }
        #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN) && \
             (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_CAP_EN))
            tempStatus = Cy_CapSense_MeasureCapacitanceCap_V2(CY_CAPSENSE_BIST_CSH_ID_E, &capCapacitance,
                    CY_CAPSENSE_BIST_CAP_MEAS_CSH_MAX_VALUE, context);
            if (CY_CAPSENSE_BIST_SUCCESS_E != tempStatus)
            {
                bistStatus = tempStatus;
            }
        #endif /* ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN) && \
                   (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_CAP_EN)) */
    #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) */

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
        tempStatus = Cy_CapSense_MeasureCapacitanceCap_V2(CY_CAPSENSE_BIST_CINTA_ID_E, &capCapacitance,
                CY_CAPSENSE_BIST_CAP_MEAS_CINT_MAX_VALUE, context);
        if (CY_CAPSENSE_BIST_SUCCESS_E != tempStatus)
        {
            bistStatus = tempStatus;
        }
        tempStatus = Cy_CapSense_MeasureCapacitanceCap_V2(CY_CAPSENSE_BIST_CINTB_ID_E, &capCapacitance,
                CY_CAPSENSE_BIST_CAP_MEAS_CINT_MAX_VALUE, context);
        if (CY_CAPSENSE_BIST_SUCCESS_E != tempStatus)
        {
            bistStatus = tempStatus;
        }
    #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN) */

    return bistStatus;
}
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_EXTERNAL_CAP_EN) */


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_VDDA_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_MeasureVdda_V2
****************************************************************************//**
*
* Measures a VDDA voltage, returns the measured voltage in
* millivolts through the ptrValue argument and stores it to the .vddaVoltage
* field of the \ref cy_stc_capsense_bist_context_t structure.
*
* This function measures the device analog supply voltage (VDDA) without need
* of explicitly connecting VDDA to any additional GPIO input.
* This capability can be used in various cases, for example to monitor
* the battery voltage.
*
* A measurement can be done only if the CAPSENSE&trade; middleware is in the IDLE
* state. This function must not be called while the CAPSENSE&trade; middleware is busy.
* The function is blocking, i.e. waits for the conversion to be completed
* prior to returning to the caller.
*
* \note
* This function is available only for the fourth-generation CAPSENSE&trade;.
*
* \param ptrValue
* The pointer to the uint32_t to store measured VDDA voltage value.
* If the ptrValue parameter is NULL then VDDA voltage value is not returned
* through the parameter and is stored in the .vddaVoltage
* field of the \ref cy_stc_capsense_bist_context_t structure.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns a status of the test execution:
* - CY_CAPSENSE_BIST_SUCCESS_E          - The measurement executed
*                                         successfully.
* - CY_CAPSENSE_BIST_BAD_PARAM_E        - The input parameter is invalid.
*                                         The measurement was not executed.
* - CY_CAPSENSE_BIST_ERROR_E            - An unexpected fault occurred during
*                                         the measurement.
*
*******************************************************************************/
cy_en_capsense_bist_status_t Cy_CapSense_MeasureVdda_V2(
                uint32_t * ptrValue,
                cy_stc_capsense_context_t * context)
{
    cy_en_capsense_return_status_t csStatus;
    cy_en_capsense_bist_status_t result = CY_CAPSENSE_BIST_BAD_PARAM_E;

    if (NULL != context)
    {
        csStatus = Cy_CapSense_SwitchSensingMode(CY_CAPSENSE_BIST_GROUP, context);

        if (CY_CAPSENSE_SUCCESS_E == csStatus)
        {
            Cy_CapSense_BistSwitchHwConfig(CY_CAPSENSE_BIST_HW_VDDA_E, context);
            result = Cy_CapSense_BistMeasureVddaRun(context);
            if ((NULL != ptrValue) && (CY_CAPSENSE_BIST_SUCCESS_E == result))
            {
                *ptrValue = (uint16_t)context->ptrBistContext->vddaVoltage;
            }
        }
        else
        {
            result = CY_CAPSENSE_BIST_ERROR_E;
        }
    }

    return result;
}


