zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_selftest_v2.c
/*******************************************************************************
* Function Name: Cy_CapSense_BistMeasureVddaInit
****************************************************************************//**
*
* This internal function calculates the parameters for VDDA measurement
* and register values before speeding up the execution.
*
* It is called by Cy_CapSense_BistDsInitialize() once at the CAPSENSE&trade; MW start.
*
* The following parameters of cy_stc_capsense_bist_context_t are used as
* an input for the calculation:
* * .vddaModClk
* * .vddaVrefMv
*
* The following parameters of cy_stc_capsense_bist_context_t are updated
* by the calculation:
* * .vddaModClk
* * .vddaVrefMv
* * .vddaVrefGain
* * .vddaIdacDefault
* * .vddaAzCycles
* * .vddaAcqCycles
*
* Restarting CAPSENSE&trade; MW or calling of the Cy_CapSense_BistDsInitialize()
* function overwrites the output parameters.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
static void Cy_CapSense_BistMeasureVddaInit(cy_stc_capsense_context_t * context)
{
    uint32_t idacVal;
    uint32_t vddaValMv;
    uint32_t vrefValMv;
    uint32_t maxVoltageMv;
    uint32_t fsmFreqHz;

    vddaValMv = (uint32_t)context->ptrCommonConfig->vdda;
    vrefValMv = (uint32_t)context->ptrBistContext->vddaVrefMv;

    /* Check for the Vref limitations */
    if (vrefValMv > (vddaValMv - CY_CAPSENSE_BIST_VDDA_MIN_DIFF))
    {
        vrefValMv = (vddaValMv - CY_CAPSENSE_BIST_VDDA_MIN_DIFF);
    }
    if (vrefValMv < CY_CAPSENSE_BIST_VDDA_VREF_MIN_MV)
    {
        vrefValMv = CY_CAPSENSE_BIST_VDDA_VREF_MIN_MV;
    }

    /* Calculate the refgen gain for the desired reference voltage */
    context->ptrBistContext->vddaVrefGain = (uint8_t)Cy_CapSense_GetVrefHighGain(vrefValMv, context);
    /* Calculate the reference voltage */
    vrefValMv = Cy_CapSense_GetVrefHighMv((uint32_t)context->ptrBistContext->vddaVrefGain, context);

    /* Update the nominal Vref to real Vref considering available trimming for SRSS */
    #if (CY_CAPSENSE_PSOC6_FOURTH_GEN)
        if (CY_CAPSENSE_VREF_SRSS == context->ptrCommonConfig->ssVrefSource)
        {
            vrefValMv = Cy_CSD_GetVrefTrim(vrefValMv);
        }
    #endif

    maxVoltageMv = (((vddaValMv - vrefValMv) > vrefValMv) ? (vddaValMv - vrefValMv) : vrefValMv);

    if (context->ptrBistContext->vddaModClk == 0u)
    {
        context->ptrBistContext->vddaModClk = 1u;
    }
    if ((context->ptrCommonConfig->periClkHz / context->ptrBistContext->vddaModClk) > CY_CAPSENSE_BIST_VDDA_MAX_MODCLK)
    {
        context->ptrBistContext->vddaModClk++;
    }
    idacVal = (context->ptrCommonConfig->periClkHz / CY_CAPSENSE_BIST_VDDA_RES) / context->ptrBistContext->vddaModClk;
    idacVal = (((idacVal * maxVoltageMv) / CY_CAPSENSE_CONVERSION_MEGA) * CY_CAPSENSE_BIST_VDDA_CREF) /
                 CY_CAPSENSE_BIST_VDDA_IDAC_LSB;

    if (CY_CAPSENSE_BIST_IDAC_MAX < idacVal)
    {
        idacVal = CY_CAPSENSE_BIST_IDAC_MAX;
    }
    if (0u == idacVal)
    {
        idacVal = 1u;
    }

    context->ptrBistContext->vddaIdacDefault = (uint8_t)idacVal;
    context->ptrBistContext->vddaVrefMv = (uint16_t)vrefValMv;

    fsmFreqHz = (context->ptrCommonConfig->periClkHz / context->ptrBistContext->vddaModClk) /
                 CY_CAPSENSE_BIST_VDDA_SENSE_PERIOD_DEFAULT;
    context->ptrBistContext->vddaAzCycles = (uint8_t)((CY_CAPSENSE_BIST_VDDA_AZ_TIME_US * fsmFreqHz) /
                                                       CY_CAPSENSE_CONVERSION_MEGA);
    context->ptrBistContext->vddaAcqCycles = (uint8_t)((CY_CAPSENSE_BIST_VDDA_ACQ_TIME_US * fsmFreqHz) /
                                                        CY_CAPSENSE_CONVERSION_MEGA);
}


/*******************************************************************************
* Function Name: Cy_CapSense_BistMeasureVddaEnable
****************************************************************************//**
*
* This internal function configures the CSD HW block operation and the
* block-level analog routing for the VDDA measurement.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
static void Cy_CapSense_BistMeasureVddaEnable(cy_stc_capsense_context_t * context)
{
    uint32_t temp;
    CSD_Type * ptrCsdHwBase = context->ptrCommonConfig->ptrCsdBase;

    /* Disable all interrupts from the HW block */
    ptrCsdHwBase->INTR_MASK = CY_CAPSENSE_CSD_INTR_MASK_CLEAR_MSK;
    (void)ptrCsdHwBase->INTR_MASK;
    /* Clear all pending interrupt requests */
    ptrCsdHwBase->INTR = CY_CAPSENSE_CSD_INTR_ALL_MSK;
    (void)ptrCsdHwBase->INTR;

    /* Set the divider value for mod clock (1u lower than the desired divider) */
    Cy_CapSense_SetClkDivider(((uint32_t)context->ptrBistContext->vddaModClk - 1u), context);

    Cy_CapSense_BistSwitchAllSnsPinState(CY_CAPSENSE_BIST_IO_STRONG_E, context);
    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN)
        Cy_CapSense_BistSwitchAllShieldPinState(CY_CAPSENSE_BIST_IO_STRONG_E, context);
    #endif
    Cy_CapSense_BistSwitchAllExternalCapPinState(CY_CAPSENSE_BIST_IO_STRONG_E, context);
    /* Wait for the maximum possible external capacitor charging time */
    Cy_SysLib_DelayUs(context->ptrBistContext->capacitorSettlingTime);

    /* Configure the HW block for operation in VDDA measurement mode */
    ptrCsdHwBase->CONFIG = CY_CAPSENSE_BIST_VDDA_CONFIG_DEFAULT;
    ptrCsdHwBase->SW_REFGEN_SEL = CY_CAPSENSE_CSD_SW_REFGEN_SEL_SW_SGR_MSK;
    #if (CY_CAPSENSE_PSOC6_FOURTH_GEN)
        if (CY_CAPSENSE_IREF_PASS == context->ptrCommonConfig->ssIrefSource)
        {
            ptrCsdHwBase->CONFIG = CY_CAPSENSE_BIST_VDDA_CONFIG_DEFAULT |
                                   CY_CAPSENSE_CSD_CONFIG_IREF_SEL_MSK;
        }
        if (CY_CAPSENSE_VREF_PASS == context->ptrCommonConfig->ssVrefSource)
        {
            ptrCsdHwBase->SW_REFGEN_SEL = CY_CAPSENSE_CSD_SW_REFGEN_SEL_SW_SGRP_MSK;
        }
        ptrCsdHwBase->IO_SEL = CY_CAPSENSE_BIST_VDDA_IO_SEL_DEFAULT;
    #endif

    /* RefGen initialization */
    temp = CSD_REFGEN_REFGEN_EN_Msk | CSD_REFGEN_RES_EN_Msk |
            ((uint32_t)(context->ptrBistContext->vddaVrefGain) << CSD_REFGEN_GAIN_Pos);
    #if (CY_CAPSENSE_PSOC4_FOURTH_GEN)
        if (CY_CAPSENSE_LOW_VOLTAGE_LIMIT > context->ptrCommonConfig->vdda)
        {
            temp = CSD_REFGEN_REFGEN_EN_Msk | CSD_REFGEN_BYPASS_Msk;
        }
    #endif

    ptrCsdHwBase->HSCMP = CY_CAPSENSE_BIST_VDDA_HSCMP_DEFAULT;
    ptrCsdHwBase->AMBUF = CY_CAPSENSE_BIST_VDDA_AMBUF_DEFAULT;
    ptrCsdHwBase->REFGEN = temp;
    ptrCsdHwBase->SENSE_PERIOD = (uint32_t)CY_CAPSENSE_BIST_VDDA_SENSE_PERIOD_DEFAULT - 1u;
    ptrCsdHwBase->CSDCMP = CY_CAPSENSE_BIST_VDDA_CSDCMP_DEFAULT;
    ptrCsdHwBase->IDACA = CY_CAPSENSE_BIST_VDDA_IDACA_DEFAULT;
    ptrCsdHwBase->IDACB = (uint32_t)CY_CAPSENSE_BIST_VDDA_IDACB_DEFAULT |
                          context->ptrBistContext->vddaIdacDefault;
    ptrCsdHwBase->SEQ_TIME = (uint32_t)context->ptrBistContext->vddaAzCycles - 1u;
    ptrCsdHwBase->ADC_CTL = (uint32_t)context->ptrBistContext->vddaAcqCycles - 1u;
    ptrCsdHwBase->SENSE_DUTY = CY_CAPSENSE_BIST_VDDA_SENSE_DUTY_DEFAULT;
    ptrCsdHwBase->SEQ_INIT_CNT = CY_CAPSENSE_BIST_VDDA_SEQ_INIT_CNT_DEFAULT;
    ptrCsdHwBase->SEQ_NORM_CNT = CY_CAPSENSE_BIST_VDDA_SEQ_NORM_CNT_DEFAULT;
    ptrCsdHwBase->SW_RES = CY_CAPSENSE_BIST_VDDA_SW_RES_DEFAULT;
    ptrCsdHwBase->SW_HS_P_SEL = CY_CAPSENSE_BIST_VDDA_SW_HS_P_SEL_DEFAULT;
    ptrCsdHwBase->SW_HS_N_SEL = CY_CAPSENSE_BIST_VDDA_SW_HS_N_SEL_DEFAULT;
    ptrCsdHwBase->SW_SHIELD_SEL = CY_CAPSENSE_BIST_VDDA_SW_SHIELD_SEL_DEFAULT;
    ptrCsdHwBase->SW_AMUXBUF_SEL = CY_CAPSENSE_BIST_VDDA_SW_AMUXBUF_SEL_DEFAULT;
    ptrCsdHwBase->SW_BYP_SEL = CY_CAPSENSE_BIST_VDDA_SW_BYP_SEL_DEFAULT;
    ptrCsdHwBase->SW_CMP_P_SEL = CY_CAPSENSE_BIST_VDDA_SW_CMP_P_SEL_DEFAULT;
    ptrCsdHwBase->SW_CMP_N_SEL = CY_CAPSENSE_BIST_VDDA_SW_CMP_N_SEL_DEFAULT;
    ptrCsdHwBase->SW_FW_MOD_SEL = CY_CAPSENSE_BIST_VDDA_SW_FW_MOD_SEL_DEFAULT;
    ptrCsdHwBase->SW_FW_TANK_SEL = CY_CAPSENSE_BIST_VDDA_SW_FW_TANK_SEL_DEFAULT;
    ptrCsdHwBase->SW_DSI_SEL = CY_CAPSENSE_BIST_VDDA_SW_DSI_SEL_DEFAULT;
}


