zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_selftest_v2.c
    /* Connect all electrode pins */
    for (i = 0u; i < ptrEltdCfg->numPins; i++)
    {
        Cy_CapSense_SsConfigPinRegisters(ptrPinCfg->pcPtr, (uint32_t)ptrPinCfg->pinNumber,
                CY_CAPSENSE_CSD_SCAN_PIN_DM, CY_CAPSENSE_HSIOM_SEL_CSD_SENSE);
        ptrPinCfg++;
    }
}


/*******************************************************************************
* Function Name: Cy_CapSense_BistDisconnectElectrode
****************************************************************************//**
*
* This internal function disconnects the electrode (including a ganged one)
* from the CSD HW block and sets all its pins to the configured
* in the .snsCapCsdISC or .snsCapCsxISC fields
* of the cy_stc_capsense_bist_context_t structure.
*
* The function gets the pin configuration registers addresses, their shifts and
* masks from the cy_stc_capsense_pin_config_t object. Based on this data, it
* updates the HSIOM and PC registers.
*
* Do not call this function directly from the application program -
* the project behavior is unpredictable.
*
* \param widgetId
* Specifies the ID number of the widget.
* A macro for the widget ID can be found in the
* CAPSENSE&trade; Configuration header file (cycfg_capsense.h) defined as
* CY_CAPSENSE_<WidgetName>_WDGT_ID.
*
* \param electrodeId
* Specifies the ID of the sensor (electrode for CSX widgets) within the widget
* to be measured.
*
* For the CSD widgets, a macro for the electrodeId is identical
* to the sensor ID within the specified widget and can be found
* in the CAPSENSE&trade; Configuration header file (cycfg_capsense.h)
* defined as CY_CAPSENSE_<WidgetName>_SNS<SensorNumber>_ID.
*
* For the CSX widgets, the electrode ID is defined as Rx electrode ID
* or Tx electrode ID. The first Rx in a widget corresponds to electrodeId = 0,
* the second Rx in a widget corresponds to electrodeId = 1, and so on.
* The last Tx in a widget corresponds to electrodeId = (RxNum + TxNum - 1).
* Macros for Rx and Tx IDs can be found in the CAPSENSE&trade; Configuration header
* file (cycfg_capsense.h) defined as:
* * CapSense_<WidgetName>_RX<RXNumber>_ID
* * CapSense_<WidgetName>_TX<TXNumber>_ID.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
static void Cy_CapSense_BistDisconnectElectrode(
                uint32_t widgetId,
                uint32_t electrodeId,
                const cy_stc_capsense_context_t * context)

{
    uint32_t i;
    uint32_t driveModeTmp;
    en_hsiom_sel_t hsiomTmp;
    const cy_stc_capsense_electrode_config_t * ptrEltdCfg = &context->ptrWdConfig[widgetId].ptrEltdConfig[electrodeId];
    const cy_stc_capsense_pin_config_t * ptrPinCfg = ptrEltdCfg->ptrPin;

    /* Change Drive mode and HSIOM depending on the current inactive sensor connection */
    switch (context->ptrBistContext->currentISC)
    {
        case CY_CAPSENSE_BIST_IO_STRONG_E:
            driveModeTmp = CY_CAPSENSE_DM_GPIO_STRONG_IN_OFF;
            hsiomTmp = CY_CAPSENSE_HSIOM_SEL_GPIO;
            break;
        case CY_CAPSENSE_BIST_IO_SHIELD_E:
            driveModeTmp = CY_CAPSENSE_DM_SHIELD;
            hsiomTmp = CY_CAPSENSE_HSIOM_SEL_CSD_SHIELD;
            break;
        default:
            driveModeTmp = CY_CAPSENSE_DM_GPIO_ANALOG;
            hsiomTmp = CY_CAPSENSE_HSIOM_SEL_GPIO;
            break;
    }

    /* Disconnect all electrode pins */
    for (i = 0u; i < ptrEltdCfg->numPins; i++)
    {
        Cy_CapSense_SsConfigPinRegisters(ptrPinCfg->pcPtr, (uint32_t)ptrPinCfg->pinNumber, driveModeTmp, hsiomTmp);
        Cy_GPIO_Clr(ptrPinCfg->pcPtr, (uint32_t)ptrPinCfg->pinNumber);

        ptrPinCfg++;
    }
}
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SNS_CAP_EN) */


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SNS_CAP_EN) || \
    (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SH_CAP_EN)  || \
    (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_EXTERNAL_CAP_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_BistWaitEndOfScan
****************************************************************************//**
*
* This internal function checks for the scan status. If the scan ends before
* the software watch-dog triggering, the function returns a non-zero watch-dog
* cycles number. If the software watch-dog triggers during the scan,
* the function returns zero.
*
* \param watchdogCycleNum
* A watch-dog cycle number to check a timeout.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns watch-dog counter. If it is equal to zero, it means timeout happened.
*
*******************************************************************************/
static uint32_t Cy_CapSense_BistWaitEndOfScan(
                uint32_t watchdogCycleNum,
                const cy_stc_capsense_context_t * context)
{
    uint32_t watchdogCounter = watchdogCycleNum;

    while (((context->ptrCommonConfig->ptrCsdBase->INTR &
             CY_CAPSENSE_CSD_INTR_SAMPLE_MSK) == 0u) && (0u != watchdogCounter))
    {
        watchdogCounter--;
    }

    return watchdogCounter;
}
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SNS_CAP_EN) || \
          (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SH_CAP_EN)  || \
          (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_EXTERNAL_CAP_EN) */

#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_HW_GROUP_EN) */

#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_BIST_EN) */

#endif /* (defined(CY_IP_MXCSDV2) || defined(CY_IP_M0S8CSDV2)) */


/* [] END OF FILE */
